[
    {
        "name": "Mom",
        "image": "https://gravatar.com/images/homepage/avatar-01.png",
        "messages": [
            { "type": "received", "text": "Where have you been for the past six days? You didn’t even tell me you were leaving! I’ve been worried sick." },
            { "type": "sent", "text": "Mom, I’m really sorry. I didn’t mean to worry you. I had to sort out some things for school, but I should’ve told you." },
            { "type": "received", "text": "You should have told me! You know how much I worry about you. What exactly were you doing for six days?" },
            { "type": "sent", "text": "I was working on some school projects and assignments, but I fell behind. I needed time to catch up before everything spirals out of control." },
            { "type": "received", "text": "And why didn’t you tell me? This is serious. You could have at least communicated." },
            { "type": "sent", "text": "I understand, and I really regret not keeping you in the loop. But I’ve got a huge pile of work that’s due soon, and it’s kind of overwhelming." },
            { "type": "received", "text": "This isn’t good, especially with everything going on. Have you spoken to your teacher about it?" },
            { "type": "sent", "text": "I haven’t yet... I was afraid they'd get mad or think I’m irresponsible." },
            { "type": "received", "text": "You have to face it, though. Tell them what's going on. You can’t keep avoiding the problem." },
            { "type": "sent", "text": "Yeah, you’re right. I need to start talking to my teachers and figure out a way to get things done." },
            { "type": "received", "text": "Okay. But don’t forget—you’ve got to apologize to me and keep me updated. If you’re handling this, I want to know." },
            { "type": "sent", "text": "I promise, Mom. I’ll keep you updated. Thanks for understanding." },
            { "type": "received", "text": "I’ll always understand, but you have to take responsibility. Please, don’t leave it until the last minute again." },
            { "type": "sent", "text": "I won’t. I’m going to fix this." },
            { "type": "received", "text": "I’m counting on you. Let me know if you need anything." }
        ]
    },
    {
        "name": "Teacher",
        "image": "https://via.placeholder.com/30",
        "messages": [
            { "type": "received", "text": "I’ve noticed you haven’t submitted any of your assignments yet. Is everything okay?" },
            { "type": "sent", "text": "Hi, Mrs. Anderson. I’m really sorry. I’ve been dealing with some personal stuff, and I fell behind on my work." },
            { "type": "received", "text": "I understand things can get overwhelming. But you need to take responsibility for your deadlines. Have you made any progress?" },
            { "type": "sent", "text": "I haven’t submitted anything yet. I’ve got a lot of catching up to do, but I’m planning to start as soon as possible." },
            { "type": "received", "text": "You should have let me know sooner. Are you asking for extensions on any of your assignments?" },
            { "type": "sent", "text": "I’m not sure if that’s possible, but I’d really appreciate it if you could help me out with some advice on how to manage everything." },
            { "type": "received", "text": "I can help you prioritize and organize your tasks. But you need to be proactive about this." },
            { "type": "sent", "text": "I promise I will. I’ll start with the practice assignments first and then focus on the main project." },
            { "type": "received", "text": "Good. But you should also be aware that you might need to stay after school to complete everything." },
            { "type": "sent", "text": "I understand. I’m willing to do whatever it takes to catch up." },
            { "type": "received", "text": "Alright. Make sure you stay on top of your work. If you need extra help, feel free to reach out." },
            { "type": "sent", "text": "Thank you so much for understanding. I’ll make sure to keep in touch if I need assistance." },
            { "type": "received", "text": "Just remember, this doesn’t happen again. You know better." },
            { "type": "sent", "text": "It won’t. I’ve learned my lesson." },
            { "type": "received", "text": "Good. Stay on track, and we’ll make sure you can finish everything." }
        ]
    },
    {
        "name": "Farhad",
        "image": "https://via.placeholder.com/30",
        "messages": [
            { "type": "sent", "text": "Hey! How’s everything going with your projects?" },
            { "type": "received", "text": "Hey, it's been tough. I’ve been out of the house for a while and now I’m way behind on my assignments." },
            { "type": "sent", "text": "Oh no, that’s rough! What do you have left to do?" },
            { "type": "received", "text": "I have a bunch of practice assignments to submit, and my final project is still not done." },
            { "type": "sent", "text": "That sounds stressful. Have you told your teacher about it?" },
            { "type": "received", "text": "Not yet. I’m scared they’ll get mad at me. But I need to figure out a way to catch up." },
            { "type": "sent", "text": "You need to talk to them, man. They’ll respect you more if you’re honest about what’s going on." },
            { "type": "received", "text": "Yeah, you’re right. I just feel like I’m already too behind to fix this." },
            { "type": "sent", "text": "You can still fix it! Start small and tackle one task at a time." },
            { "type": "received", "text": "I’ll try. I’m just overwhelmed with everything." },
            { "type": "sent", "text": "I get it. But don’t wait any longer. Do something today!" },
            { "type": "received", "text": "Okay, I’ll try. But what about you? How’s your work going?" },
            { "type": "sent", "text": "Same here! I’m barely keeping up, but I’m pushing through." },
            { "type": "received", "text": "We’ll get through it, bro. Just hang in there." },
            { "type": "sent", "text": "Yeah, we got this! Let’s talk again soon and check in on each other." },
            { "type": "received", "text": "Definitely. We’ll catch up soon." }
        ]
    },
    {
        "name": "Aisha",
        "image": "https://via.placeholder.com/30",
        "messages": [
            { "type": "sent", "text": "Hey! Have you finished your project?" },
            { "type": "received", "text": "No, I’m way behind. I’ve been dealing with some stuff and didn’t submit anything." },
            { "type": "sent", "text": "Oh no, that’s not good. Do you need help catching up?" },
            { "type": "received", "text": "Yeah, I’m definitely behind. But I think I’ll be okay if I focus hard." },
            { "type": "sent", "text": "You’ll get it done! What do you have left to do?" },
            { "type": "received", "text": "I still need to submit the practice assignments and finish the final project." },
            { "type": "sent", "text": "That’s a lot, but it’s possible if you stay focused. Have you spoken to your teacher about it?" },
            { "type": "received", "text": "Not yet. I’m afraid they’ll be disappointed." },
            { "type": "sent", "text": "They might be, but they’ll respect your honesty. Just let them know what’s going on." },
            { "type": "received", "text": "Yeah, you’re right. I’ll do that." },
            { "type": "sent", "text": "Good luck! Let me know if you need any help." },
            { "type": "received", "text": "Thanks, I’ll definitely reach out if I need it." },
            { "type": "sent", "text": "You’ve got this, Aisha. Stay strong!" },
            { "type": "received", "text": "I’ll try! Thanks for the support." }
        ]
    }
]
